{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "name": "conv2d_13", "kernel_constraint": null, "dtype": "float32", "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1]}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_22", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"scale": true, "name": "batch_normalization_13", "axis": -1, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "name": "conv2d_14", "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_23", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"scale": true, "name": "batch_normalization_14", "axis": -1, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_10", "trainable": true, "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "name": "conv2d_15", "kernel_constraint": null, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_24", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"scale": true, "name": "batch_normalization_15", "axis": -1, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_11", "trainable": true, "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "name": "conv2d_16", "kernel_constraint": null, "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "kernel_size": [3, 3], "trainable": true, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_25", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"scale": true, "name": "batch_normalization_16", "axis": -1, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_12", "trainable": true, "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_10", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_10", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_26", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_11", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_11", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_27", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_12", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_12", "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "trainable": true, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_28", "trainable": true}}], "keras_version": "2.0.2", "backend": "tensorflow"}